<p>Enquanto o poste d&aacute; a luz por cima, n&oacute;s desenvolvedores estamos nos esfor&ccedil;ando para dar a luz por onde der, pois esse blog est&aacute; realmente um parto complicado!</p>

<p>Juntando uma velha vontade com a necessidade de se implementar algo para uma disciplina de Engenharia de Software, estamos trazendo ao mundo dos vivos a primeira vers&atilde;o alpha do Poste.</p>

<p>O objetivo &eacute; criar uma engine minimalista capaz de sustentar um blog m&eacute;dio com o que h&aacute; de mais moderno em termos de tecnologia de aplica&ccedil;&otilde;es para a web.</p>

<p>O quesito minimalismo &eacute; o aspecto mais atendido at&eacute; o momento, pois ainda n&atilde;o foi implementada nem a interface de edi&ccedil;&atilde;o de posts nem a possibilidade de adi&ccedil;&atilde;o de coment&aacute;rios. &eacute;, por enquanto s&oacute; vai mostrar os posts que j&aacute; estiverem no banco de dados...</p>

<p>N&atilde;o se assutem, mesmo para cinco destemidos desenvolvedores &eacute; complicado manter em dia a vida real, a acad&ecirc;mica e ainda tocar esse projeto.</p>

<h2>O Que vem por a&iacute;?</h2>

<p>A resposta curta &eacute;: Muita Coisa! N&atilde;o estamos muito afim de re-escrever coisas que j&aacute; existem. J&aacute; gastamos nossa cota de re-inven&ccedil;&atilde;o da roda (quase) criando uma engine para blog, portanto pretendemos integrar o blog con servi&ccedil;os como o <a href="http://disqus.com/">Disqus</a> para coment&aacute;rios, <a href="http://github.com/">github.com</a> para code snippets, melhorar nosso sitema de temas para que err... funcione, entre outras coisas legais.</p>

<p>O backend do blog &eacute; escrito em Perl usando o framework <a href="http://mojolicious.org">Mojolicious</a> acessando uma base de dados <a href="http://www.sqlite.org/">SQLite</a> via <a href="http://search.cpan.org/dist/ORLite/lib/ORLite.pm">ORLite</a>. Enquanto isso a camada de apresenta&ccedil;&atilde;o fica por conta do excelente <a href="http://template-tollkit.org">Template Toolkit</a>.</p>

<p>Agora que lan&ccedil;amos um alpha (ufa!) teremos nossas merecidas f&eacute;rias. A Academia chama para as famigeradas semanas de provas, pausando o nosso desenvolvimento por um breve per&iacute;odo. Voltaremos &agrave; ativa no dia 4 de outubro, quando a partir de ent&atilde;o, posts di&aacute;rios dos desenvolvedores dar&atilde;o in&iacute;cio ao BBP (Big Brother Poste). N&atilde;o percam!</p>

